vegeta-cli/src/vegeta/aeromant/templates/laminar_external/org/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case (OpenFOAM.org dialect) — placeholder values are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ({{VELOCITY}} 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ({{VELOCITY}} 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform ({{VELOCITY}} 0 0);
    }
    sides
    {
        type            slip;
    }
    "body.*"
    {
        type            noSlip;
    }
}

// ************************************************************************* //
