vegeta-cli/src/vegeta/aeromant/templates/laminar_external/org/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case (OpenFOAM.org dialect) — placeholder values are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  laminar;

// ************************************************************************* //
